2023-10-25-qgis_plugin.org
#+TITLE: QGISとPythonによるGISプラグイン実践的開発セミナー
#+SUBTITLE: 2023年10月25日，ビデオ会議システムZoom開催
#+AUTHOR: JSAI 生産・経営情報部会
#+Revised: Time-stamp: <2023-09-25 11:48:53 masaei>
* Export Configuration                                     :noexport:ARCHIVE:
#+STARTUP: content indent hideblocks shrink
#+LANGUAGE: ja
#+OPTIONS: toc:nil num:t H:4 ^:nil
#+OPTIONS: html-style:nil
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/default-style.css"/>
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style.css"/>
* 目次                                                               :ignore:
#+TOC: headlines 3

* セミナー案内
** 概要
:PROPERTIES:
:UNNUMBERED: t
:END:
1) 内容
   - 本セミナーでは，GISソフトウェアQGISとプログラミング言語Pythonを組み合わせた独自のプラグインを実装する方法について学びます。関連する研究成果発表もあります。
2) 対象
   - 農業情報学会会員のうち
     + GIS分析に興味がある初心者〜中級者レベルの方
     + GIS (QGIS) にPythonで作成したプラグインを開発することに興味がある方
3) 参加者が当日準備するもの
   - パソコン
   - QGIS（バージョン3.28以上を事前にインストール）
   - テキストエディタ (インデント機能のあるもの) 講師は Visual Studio Code を使用します。
4) 日時
   - 2023年10月25日13時30分〜16時45分
5) 場所
   - ビデオ会議システム Zoom
6) 講師
   - 山手 規裕 氏（Pacific Spatial Solutions株式会社）
7) 座長
   - 寺元郁博（農研機構農業情報研究センター）
8) 参加費
   - 無料
9) 主催
   - 農業情報学会 生産・経営情報部会
10) 共催
    - 農業情報学会 リモートセンシング部会
11) 後援
    - 一般社団法人OSGeo日本支部
** 講師プロフィール
:PROPERTIES:
:UNNUMBERED: t
:END:
- 山手 規裕 氏（Pacific Spatial Solutions株式会社）
  + 活動経歴など
  + 著書など

* 事前準備
- セミナーでは講師の説明を聴きながら参加者ご自身で実際にプログラムを実行してもらいますので，参加者は事前の準備をお願いします。なお，プログラム言語Pythonは，QGISにバンドルされているものを利用できますので，Python単体のインストールは不要です。
** QGISについて
:PROPERTIES:
:UNNUMBERED: t
:END:
- インストールは，以下のページ等を参考にご自身の環境にあったQGISをインストールしてください。
  + 「自分の環境にあったQGISのダウンロード」 https://qgis.org/ja/site/forusers/download.html
** テキストエディタについて
:PROPERTIES:
:UNNUMBERED: t
:END:
- テキストエディタは，Pythonコードを編集するために用いますので，インデント機能のあるものを推奨します。なお 講師は Visual Studio Code を使用して説明します。
  + Visual Studio Code https://azure.microsoft.com/ja-jp/products/visual-studio-code
  + その他： それ以外に Jupyter Notebook，Notepad++，Emacs などなど何でもかまいません。

* 当日のタイムテーブル
- 10月25日(水)，13:15開場，セミナー13:30〜16:45
- 座長： 寺元郁博（農研機構）
|----------+------------+--------------------------------------------------------------------------------------------------------------+--------|
| 開始時刻 | 内容       | 担当                                                                                                         | (時間) |
|----------+------------+--------------------------------------------------------------------------------------------------------------+--------|
|    13:30 | 開会       | 生産・経営情報部会：佐藤正衛（農研機構北海道農業研究センター）                                               | 5分    |
|    13:35 | 研究発表   | 研究事例①：西村和志（農研機構北海道農業研究センター），研究事例②：孫雯莉（農研機構西日本農業研究センター） | 15分   |
|    13:50 | ハンズオン | 山手規裕（Pacific Spatial Solutions株式会社）                                                                | 150分  |
|    16:20 | 振り返り   | 講師、発表者                                                                                                 | 20分   |
|    16:40 | 閉会       | リモートセンシング部会：清水庸（高崎健康福祉大学）                                                           | 5分    |
|----------+------------+--------------------------------------------------------------------------------------------------------------+--------|

* 当日の開催要領
** Zoomミーティングへの参加方法
:PROPERTIES:
:UNNUMBERED: t
:END:
- Zoomミーティングのアドレスパスワードは，参加申込み時に登録されたメールアドレスへ送信します。(10月23日の予定)
- ミーティングへ参加するときのお名前は「氏名（所属）」としてください。
** 配付資料等
:PROPERTIES:
:UNNUMBERED: t
:END:
- セミナーの説明資料(プレゼン資料，使用プログラムコード，データ等)も登録メールアドレスへご連絡します。

# Local Variables:
# org-html-validation-link: nil
# End:
